cls
@echo off
@CHCP 1251
cls

:start

echo =============================================================================================================
echo Ýòîò ñêðèïò íóæåí äëÿ àâòîìàòèçàöèè äîáàâëåíèÿ ÷èñòîãî ïðîåêòà íà GitHub / Ïðîâåðåíî íà Win 10 Âåðñèÿ 1803 x64
echo Äëÿ ïðàâèëüíîé ðàáîòû ñêðèïò äîëæåí ëåæàòü íà êàòàëîã âûøå êàòàëîãà ïðîåêòà.
echo Íå çàáóäüòå óñòàíîâèòü Git for Windows íà âàø ÏÊ.
echo =============================================================================================================
echo.

REM Ïðèñâàèâàåì ïåðåìåííûì ïóñòûå çíà÷åíèÿ ÷òîáû ïðîéòè ïðîâåðêó ââîäà åñëè ïîëüçîâàòåëü íè÷åãî íå ââåäåò.
set ProjectName=""
set /p ProjectName="1. Ââåäèòå íàçâàíèå ïðîåêòà: "

set CommitComment=""
set /p CommitComment="2. Ââåäèòå êîììåíòàðèé ê êîììèòó: "

set GitProfileName=""
set /p GitProfileName="3. Ââåäèòå èìÿ âàøåãî ïðîôèëÿ íà GitHub â ôîðìàòå "anklav24" (Áåç êàâû÷åê): "

set GitHubTOKEN=""
set /p GitHubTOKEN="4. Ââåäèòå òîêåí îò GitHub: "
echo.

echo Ïîëó÷èòü òîêåí ìîæíî â ëè÷íîì êàáèíåòå GitHub.
echo https://github.com/settings/tokens
echo.

echo ==================================
echo Ðåêîìåíäàöèè ïî îôîðìëåíþ êîììèòîâ
echo ==================================
echo.

echo Ñòàðàòüñÿ ñîáëþäàòü ïðàâèëî: îäèí êîììèò - îäíà ðåøåííàÿ çàäà÷à!
echo.

echo Êàê ïðàâèëî, âàøè ñîîáùåíèÿ äîëæíû íà÷èíàòüñÿ êðàòêèì îäíîñòðî÷íûì îïèñàíèåì íå 
echo áîëåå 50 ñèìâîëîâ, çàòåì äîëæíà èäòè ïóñòàÿ ñòðîêà, ïîñëå êîòîðîé ñëåäóåò áîëåå 
echo äåòàëüíîå îïèñàíèå. Ïðîåêò Git òðåáóåò, ÷òîáû äåòàëüíîå îïèñàíèå âêëþ÷àëî âàøó ìîòèâàöèþ 
echo ïðè âíåñåíèè èçìåíåíèÿ è ñðàâíåíèå ñ òåêóùåé ðåàëèçàöèåé - ýòî õîðîøèé ïðèìåð äëÿ 
echo ïîäðàæàíèÿ. Òàê æå õîðîøåé èäååé áóäåò èñïîëüçîâàíèå ôðàç â ïîâåëèòåëüíîì íàêëîíåíèè 
echo íàñòîÿùåãî âðåìåíè. Äðóãèìè ñëîâàìè - èñïîëüçóéòå êîìàíäû. Âìåñòî “ß äîáàâèë òåñòû äëÿ” 
echo èëè “Äîáàâëåíèå òåñòîâ äëÿ”, èñïîëüçóéòå “Äîáàâèòü òåñòû äëÿ”. Íèæå ïðåäñòàâëåí øàáëîí, 
echo íàïèñàííûé Tim Pope:
echo.
echo Êðàòêîå (50 ñèìâîëîâ èëè ìåíüøå) îïèñàíèå èçìåíåíèé
echo.
echo Òåêñò áîëåå äåòàëüíîãî îïèñàíèÿ, åñëè íåîáõîäèì. Ñòàðàéòåñü
echo íå ïåðâûøàòü äëèííó ñòðîêè â 72 ñèìâîëà. Â íåêîòîðûõ ñëó÷àÿõ
echo ïåðâàÿ ñòðîêà ïîäðàçóìåâàåòñÿ êàê òåìà ïèñüìà, à âñ¸ îñòàëüíîå -
echo òåëî ïèñüìà. Ïóñòàÿ ñòðîêà, ðàçäåëÿþùàÿ ñîîáùåíèå, êðèòè÷åñêè âàæíà
echo åñëè ñóùåñòâóåò äåòàëüíîå îïèñàíèå); òàêèå óòèëèòû êàê rebase
echo ìîãóò çàïóòàòüñÿ, åñëè âû çàïóñòèòå ñðàçó äâå.
echo.
echo Ïîñëåäóþùèå ïàðàãðàôû äîëæíû îòäåëÿòüñÿ ïóñòûìè ñòðîêàìè.
echo.
echo   - Ñïèñêè òîæå ïîäõîäÿò
echo.
echo   - Îáû÷íî, ýëåìåíòû ñïèñêà îáîçíà÷àþòñÿ ñ ïîìîùüþ òèðå èëè çâ¸çäî÷êè,
echo     ïðåäâàðÿþòñÿ îäèíî÷íûì ïðîáåëîì, à ðàçäåëÿþòñÿ ïóñòîé ñòðîêîé, íî
echo     ñîãëàøåíèÿ ìîãóò îòëè÷àòüñÿ
echo.

REM Ïðîâåðÿåì ââîä, åñëè ïóñòîé ïðèñâàèâàåì äåôîëòíûå çíà÷åíèÿ íà ñâîé âêóñ
if %ProjectName%=="" (set ProjectName=New-Project)
if %CommitComment%=="" (set CommitComment=Auto Commit)
if %GitProfileName%=="" (set GitProfileName=Anklav24)
if %GitHubTOKEN%=="" (set GitHubTOKEN=YOUR_TOKEN)

echo Çàõîäèì â ïàïêó ñî ñêðèïòîì:
echo %~dp0
cd %~dp0
echo.

echo Ñîçäàåì ïàïêó ïðîåêòà "%ProjectName%":
mkdir "%ProjectName%"
echo.

echo Çàõîäèì â ïàïêó ïðîåêòà:
echo %~dp0%ProjectName%
cd %~dp0%ProjectName%
